OdDAI.ExplicitOrDerived.optional
\details
Checks whether the attribute is optional.
\returns true if the attribute is optional; otherwise, the method returns false.

OdDAI.ExplicitOrDerived.domain
\details
Retrieves the data type referenced by the attribute.
\returns A smart pointer to the data type.

OdDAI.ExplicitOrDerived.derivedAttribute
\details
Gets a derived attribute for this container.
\returns pointer to a derived attribute or NULL if declared or real kind of contained attribute is not derived.

OdDAI.ExplicitOrDerived.setDerivedAttribute(OdDAI.DerivedAttribute*)
\details
Sets a derived attribute for this container.
\param derivedAttribute      [in] Derived attribute to set.

OdDAI.ExplicitOrDerived.isDerivedAttribute
\details
Checks whether this container contains a derived attribute.
\returns true if kind of the contained attribute is kDerivedAttribute; otherwise the method returns false;

OdDAI.ExplicitOrDerived.explicitAttribute
\details
Gets an explicit attribute for this container.
\returns pointer to an explicit attribute or NULL if declared or real kind of contained attribute is not explicit.

OdDAI.ExplicitOrDerived.setExplicitAttribute(OdDAI.ExplicitAttribute*)
\details
Sets an explicit attribute for this container.
\param explicitAttribute      [in] Explicit attribute to set.

OdDAI.ExplicitOrDerived.isExplicitAttribute
\details
Checks whether this container contains an explicit attribute.
\returns true if kind of the contained attribute is kExplicitAttribute; otherwise the method returns false;

OdDAI.ExplicitOrDerived.kind
\details
Gets kind of an attribute in this container.
\returns a value from OdExplicitOrDerivedKind enumeration representing kind of the attribute.

OdDAI.ExplicitOrDerived.unset
\details
Unsets the type of an attribute associated with this object.

OdDAI.ExplicitOrDerived.exists
\details
Checks whether an explicit or derived attribute exists within this object.
\returns 0 if attribute is unset; otherwise the method returns 1.

OdDAI.ExplicitOrDerived.#ctor
\details
Default constructor for the ExplicitOrDerived class.

OdDAI.ExplicitOrDerived.createObject(OdDAI.DerivedAttribute*)
\details
Creates a new ExplicitOrDerived object from the specified DerivedAttribute object.
\param derivedAttribute      [in] Pointer to DerivedAttribute object to create from.
\returns A smart pointer to the created object.

OdDAI.ExplicitOrDerived.createObject(OdDAI.ExplicitAttribute*)
\details
Creates a new ExplicitOrDerived object from the specified ExplicitAttribute object.
\param explicitAttribute     [in] Pointer to ExplicitAttribute object to create from.
\returns A smart pointer to the created object.

OdDAI.ExplicitOrDerived
\details
Container for selection between Explicit Attribute or Derived Attribute.